eecs373-w26-telescope/telescope-nucleo/stm32f4/Core/Src/controller.cpp
                // Map angles > 180 to negative altitude values (e.g. 270 deg -> -90 deg)
                if (pitch_deg_sm > 180.0f) {
                    pitch_deg_sm -= 360.0f;
                }

                //float azimuth_deg = std::fmod(filtered_imu_heading_deg + yaw_deg_sm + 360.0f, 360.0f);
                //float az2 = std::fmod(filtered_imu_heading_deg - yaw_deg_sm + 360.0f, 360.0f);
                //float azimuth_deg = std::fmod(filtered_imu_heading_deg + yaw_deg_sm + 180.0f + 360.0f, 360.0f);
                //float az4 = std::fmod(filtered_imu_heading_deg - yaw_deg_sm + 180.0f + 360.0f, 360.0f);
                float AZ_OFFSET_DEG = -48.2;
                //float azimuth_deg = std::fmod(filtered_imu_heading_deg - yaw_deg_sm + AZ_OFFSET_DEG + 360.0f, 360.0f);
                float azimuth_deg = std::fmod(filtered_imu_heading_deg + yaw_deg_sm + 360.0f + AZ_OFFSET_DEG, 360.0f);

                constexpr float FALLBACK_LAT = 42.29243326092064f;
                constexpr float FALLBACK_LON = -83.71498310538729f;
                float lat = gps.has_fix() ? static_cast<float>(gps.latitude)  : FALLBACK_LAT;
                float lon = gps.has_fix() ? static_cast<float>(gps.longitude) : FALLBACK_LON;
                UTC time{};
                if (gps.has_fix()) {
                    time.year   = gps.year;
                    time.month  = gps.month;
                    time.day    = gps.day;
                    time.hour   = gps.utc_hours;
                    time.minute = gps.utc_minutes;
                    time.second = static_cast<int>(gps.utc_seconds);
                } else if (raspi.has_raspi_time()) {
                    time = raspi.raspi_time();
                } else {
                    time.year   = build_time::year();
                    time.month  = build_time::month();
                    time.day    = build_time::day();
                    time.hour   = build_time::hour();
                    time.minute = build_time::minute();
                    time.second = build_time::second();
                }

                {
                    TimeModePayload tm{};
                    if (gps.has_fix())               tm.mode = TIME_MODE_SATELLITE;
                    else if (raspi.has_raspi_time()) tm.mode = TIME_MODE_RASPI;
                    else                             tm.mode = TIME_MODE_COMPILE;
                    raspi.send_time_mode(tm);
                }

                state_machine.update_sensors(pitch_deg_sm, azimuth_deg, lat, lon, time);
                state_machine.tick();

                if (state_machine.selected_messier_id() >= 0) {
                    state_machine.send_dso_target_packet();
                }

                {
                    const FOV& fov = state_machine.current_fov();
                    FovObjectsPayload pkt{};
                    pkt.count = 0;
                    for (const auto& obj : fov.objects) {
                        if (pkt.count >= FOV_OBJECTS_MAX) break;
                        float x = 0.0f, y = 0.0f;
                        state_machine.project_gnomonic_local_for_current_fov(obj.pos, x, y);
                        int id = std::stoi(obj.name.substr(1));
                        auto& e = pkt.objects[pkt.count++];
                        e.messier_id = static_cast<uint16_t>(id);
                        e.x_e4 = static_cast<int16_t>(std::clamp(x, -1.0f, 1.0f) * 10000.0f);
                        e.y_e4 = static_cast<int16_t>(std::clamp(y, -1.0f, 1.0f) * 10000.0f);
                    }
                    raspi.send_fov_objects(pkt, pkt.count);
                }

                {
                    SearchGuidancePayload sg{};
                    if (state_machine.has_selected_object()) {
                        sg.has_target = 1;
                        float raw_x = 0.0f, raw_y = 0.0f;
                        const FOV& fov = state_machine.current_fov();
                        state_machine.project_gnomonic_parallactic_for_current_fov(
                            state_machine.selected_object().pos, raw_x, raw_y);
                        float mag = sqrtf(raw_x * raw_x + raw_y * raw_y);
                        if (mag > 1e-6f) {
                            sg.dx_e4 = static_cast<int16_t>((raw_x / mag) * 10000.0f);
                            sg.dy_e4 = static_cast<int16_t>((raw_y / mag) * 10000.0f);
                        }
                        float fov_r_rad = fov.radius * 3.14159265f / 180.0f;
                        float dist_deg  = atanf(mag * tanf(fov_r_rad)) * 180.0f / 3.14159265f;
                        sg.distance_e2  = static_cast<int16_t>(
                            std::min(dist_deg * 100.0f, 32767.0f));
                    }
                    raspi.send_search_guidance(sg);

                    if (now - last_sg_debug_tick >= SG_DEBUG_INTERVAL_MS) {
                        last_sg_debug_tick = now;
                        char sg_buf[96];
                        int sg_len = snprintf(sg_buf, sizeof(sg_buf),
                            "SG: has_tgt=%d dx=%.4f dy=%.4f dist=%.2fdeg\r\n",
                            sg.has_target,
                            sg.dx_e4 / 10000.0f,
                            sg.dy_e4 / 10000.0f,
                            sg.distance_e2 / 100.0f);
                        HAL_UART_Transmit(&huart3, reinterpret_cast<uint8_t*>(sg_buf),
                                          static_cast<uint16_t>(sg_len), 100);
                    }
                }

                EquatorialCoordinates eqc = state_machine.current_eqc();
                HorizontalCoordinates hc = state_machine.current_hc();
                const FOV& fov = state_machine.current_fov();

                if (now - last_astro_debug_tick >= ASTRO_DEBUG_INTERVAL_MS) {
                    last_astro_debug_tick = now;
                    char astro_buf[256];
                    int astro_len = snprintf(astro_buf, sizeof(astro_buf),
                        "ASTRO:\r\n"
                        "  ALT: %.2f deg\r\n"
                        "  AZ : %.2f deg\r\n"
                        //"  AZ 1: %.2f deg\r\n"
                        //"  AZ 2: %.2f deg\r\n"
                        //"  AZ 3: %.2f deg\r\n"
                        //"  AZ 4: %.2f deg\r\n"
                        "  LAT: %.5f  LON: %.5f\r\n"
                        "  UTC: %04d-%02d-%02d %02d:%02d:%02d\r\n"
                        "  RA : %.2f hr\r\n"
                        "  DEC: %.2f deg\r\n"
                        "  FOV r: %.2f deg  objs:%d%s\r\n",
                        static_cast<double>(hc.altitude),
                        static_cast<double>(hc.azimuth),
                       //static_cast<double>(azimuth_deg),
                        //static_cast<double>(az2),
                        //static_cast<double>(az3),
                        //static_cast<double>(az4),
                        static_cast<double>(lat),
                        static_cast<double>(lon),
                        time.year, time.month, time.day,
                        time.hour, time.minute, time.second,
                        static_cast<double>(eqc.right_ascension),
                        static_cast<double>(eqc.declination),
                        static_cast<double>(fov.radius),
                        static_cast<int>(fov.objects.size()),
                        gps.has_fix() ? "" : " [FALLBACK]"
                    );
                    HAL_UART_Transmit(&huart3,
                        reinterpret_cast<uint8_t*>(astro_buf),
                        static_cast<uint16_t>(astro_len),
                        100);

                    for (const auto& obj : fov.objects) {
                        char obj_buf[96];
                        int obj_len = snprintf(obj_buf, sizeof(obj_buf),
                            "  %s RA=%.2f DEC=%.2f mag=%.1f\r\n",
                            obj.name.c_str(),
                            static_cast<double>(obj.pos.right_ascension),
                            static_cast<double>(obj.pos.declination),
                            static_cast<double>(obj.brightness)
                        );
                        HAL_UART_Transmit(&huart3,
                            reinterpret_cast<uint8_t*>(obj_buf),
                            static_cast<uint16_t>(obj_len),
                            100);
                    }
                }
            }

            // Button press sends debug packet
            bool button_pressed = (HAL_GPIO_ReadPin(DEBUG_BUTTON_PORT, DEBUG_BUTTON_PIN) == GPIO_PIN_RESET);
            if (button_pressed && !prev_button_pressed) {
                DebugPayload dbg{};
                const char* msg = "PING";
                __builtin_memcpy(dbg.data, msg, 4);
                raspi.send_debug(dbg);
            }
            prev_button_pressed = button_pressed;
        }
    }

} // namespace telescope

extern "C" {

void PostInit() {
    telescope::init();
}

void Loop() {
    telescope::loop();
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef* huart) {
    if (huart->Instance == USART1) {
        telescope::raspi.tx_complete_callback();
    }
}

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef* huart, uint16_t Size) {
    if (huart->Instance == USART1) {
        telescope::raspi.rx_event_callback(Size);
    }
    if (huart->Instance == USART6) {
        telescope::gps.rx_event_callback(Size);
    }
}

}
